Revit 2026 API

# PipeSegmentCreate Method

---
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PipeSegment Create(
	Document ADocument,
	ElementId MaterialId,
	ElementId ScheduleId,
	ICollection<MEPSize> sizeSet
)
```
```vb
Public Shared Function Create (
	ADocument As Document,
	MaterialId As ElementId,
	ScheduleId As ElementId,
	sizeSet As ICollection(Of MEPSize)
) As PipeSegment
```
```cpp
public:
static PipeSegment^ Create(
	Document^ ADocument,
	ElementId^ MaterialId,
	ElementId^ ScheduleId,
	ICollection<MEPSize^>^ sizeSet
)
```
```fsharp
static member Create :
        ADocument : Document *
        MaterialId : ElementId *
        ScheduleId : ElementId *
        sizeSet : ICollection<MEPSize> -> PipeSegment
```

#### Parameters

ADocument Document

MaterialId ElementId

ScheduleId ElementId

sizeSet ICollectionMEPSize

#### Return Value

PipeSegment

#### Reference

PipeSegment Class

Autodesk.Revit.DB.Plumbing Namespace